app/controllers/statuses_controller.rb

  def create
    @status = current_user.statuses.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hey All, glad to be here!"], ["created_at", Sun, 26 Oct 2014 01:21:59 UTC +00:00], ["updated_at", Sun, 26 Oct 2014 01:21:59 UTC +00:00], ["user_id", 1]]